posts/2016-07-19-prayer-after-a-tragic-week.org
#+date: <2016-07-19>
#+filetags: prayer religion
#+title: Prayer After a Tragic Week

God of compassion,

In these weeks of violence and tragedy,\\
we have mourned with those who grieve,\\
cried with those who weep,\\
sat in silence with those in pain,\\
and protested with those who suffer injustice.

But what should never happen even once\\
seems to happen over and over again,\\
until we are left with nothing\\
but bloodshot eyes and numb hearts.

Banish our fears, restore our hope,\\
and give us a vision of what can be,\\
if we were to give our neighbor\\
the same grace that you have given us.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
