docs/posts/2016-07-19-prayer-after-a-tragic-week.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer After a Tragic Week</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer After a Tragic Week</h1>
<p class="subtitle" role="doc-subtitle">Jul 19, 2016</p>
</header><p>
God of compassion,
</p>

<p>
In these weeks of violence and tragedy,<br>
we have mourned with those who grieve,<br>
cried with those who weep,<br>
sat in silence with those in pain,<br>
and protested with those who suffer injustice.
</p>

<p>
But what should never happen even once<br>
seems to happen over and over again,<br>
until we are left with nothing<br>
but bloodshot eyes and numb hearts.
</p>

<p>
Banish our fears, restore our hope,<br>
and give us a vision of what can be,<br>
if we were to give our neighbor<br>
the same grace that you have given us.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org36ed50d">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
